Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/nmic.h
/**
 * \brief Component description for NMIC
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-01-08T10:06:16Z */
#ifndef _SAMRH71_NMIC_COMPONENT_H_
#define _SAMRH71_NMIC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR NMIC                                         */
/* ************************************************************************** */

/* -------- NMIC_IER : (NMIC Offset: 0x00) ( /W 32) Interrupt Enable Register -------- */
#define NMIC_IER_NMI0_Pos                     _U_(0)                                               /**< (NMIC_IER) Non-maskable Interrupt 0 Enable Position */
#define NMIC_IER_NMI0_Msk                     (_U_(0x1) << NMIC_IER_NMI0_Pos)                      /**< (NMIC_IER) Non-maskable Interrupt 0 Enable Mask */
#define NMIC_IER_NMI0(value)                  (NMIC_IER_NMI0_Msk & ((value) << NMIC_IER_NMI0_Pos))
#define NMIC_IER_NMI1_Pos                     _U_(1)                                               /**< (NMIC_IER) Non-maskable Interrupt 1 Enable Position */
#define NMIC_IER_NMI1_Msk                     (_U_(0x1) << NMIC_IER_NMI1_Pos)                      /**< (NMIC_IER) Non-maskable Interrupt 1 Enable Mask */
#define NMIC_IER_NMI1(value)                  (NMIC_IER_NMI1_Msk & ((value) << NMIC_IER_NMI1_Pos))
#define NMIC_IER_NMI2_Pos                     _U_(2)                                               /**< (NMIC_IER) Non-maskable Interrupt 2 Enable Position */
#define NMIC_IER_NMI2_Msk                     (_U_(0x1) << NMIC_IER_NMI2_Pos)                      /**< (NMIC_IER) Non-maskable Interrupt 2 Enable Mask */
#define NMIC_IER_NMI2(value)                  (NMIC_IER_NMI2_Msk & ((value) << NMIC_IER_NMI2_Pos))
#define NMIC_IER_NMI3_Pos                     _U_(3)                                               /**< (NMIC_IER) Non-maskable Interrupt 3 Enable Position */
#define NMIC_IER_NMI3_Msk                     (_U_(0x1) << NMIC_IER_NMI3_Pos)                      /**< (NMIC_IER) Non-maskable Interrupt 3 Enable Mask */
#define NMIC_IER_NMI3(value)                  (NMIC_IER_NMI3_Msk & ((value) << NMIC_IER_NMI3_Pos))
#define NMIC_IER_NMI4_Pos                     _U_(4)                                               /**< (NMIC_IER) Non-maskable Interrupt 4 Enable Position */
#define NMIC_IER_NMI4_Msk                     (_U_(0x1) << NMIC_IER_NMI4_Pos)                      /**< (NMIC_IER) Non-maskable Interrupt 4 Enable Mask */
#define NMIC_IER_NMI4(value)                  (NMIC_IER_NMI4_Msk & ((value) << NMIC_IER_NMI4_Pos))
#define NMIC_IER_NMI5_Pos                     _U_(5)                                               /**< (NMIC_IER) Non-maskable Interrupt 5 Enable Position */
#define NMIC_IER_NMI5_Msk                     (_U_(0x1) << NMIC_IER_NMI5_Pos)                      /**< (NMIC_IER) Non-maskable Interrupt 5 Enable Mask */
#define NMIC_IER_NMI5(value)                  (NMIC_IER_NMI5_Msk & ((value) << NMIC_IER_NMI5_Pos))
#define NMIC_IER_NMI6_Pos                     _U_(6)                                               /**< (NMIC_IER) Non-maskable Interrupt 6 Enable Position */
#define NMIC_IER_NMI6_Msk                     (_U_(0x1) << NMIC_IER_NMI6_Pos)                      /**< (NMIC_IER) Non-maskable Interrupt 6 Enable Mask */
#define NMIC_IER_NMI6(value)                  (NMIC_IER_NMI6_Msk & ((value) << NMIC_IER_NMI6_Pos))
#define NMIC_IER_NMI7_Pos                     _U_(7)                                               /**< (NMIC_IER) Non-maskable Interrupt 7 Enable Position */
#define NMIC_IER_NMI7_Msk                     (_U_(0x1) << NMIC_IER_NMI7_Pos)                      /**< (NMIC_IER) Non-maskable Interrupt 7 Enable Mask */
#define NMIC_IER_NMI7(value)                  (NMIC_IER_NMI7_Msk & ((value) << NMIC_IER_NMI7_Pos))
#define NMIC_IER_NMI8_Pos                     _U_(8)                                               /**< (NMIC_IER) Non-maskable Interrupt 8 Enable Position */
#define NMIC_IER_NMI8_Msk                     (_U_(0x1) << NMIC_IER_NMI8_Pos)                      /**< (NMIC_IER) Non-maskable Interrupt 8 Enable Mask */
#define NMIC_IER_NMI8(value)                  (NMIC_IER_NMI8_Msk & ((value) << NMIC_IER_NMI8_Pos))
#define NMIC_IER_Msk                          _U_(0x000001FF)                                      /**< (NMIC_IER) Register Mask  */

#define NMIC_IER_NMI_Pos                      _U_(0)                                               /**< (NMIC_IER Position) Non-maskable Interrupt 8 Enable */
#define NMIC_IER_NMI_Msk                      (_U_(0x1FF) << NMIC_IER_NMI_Pos)                     /**< (NMIC_IER Mask) NMI */
#define NMIC_IER_NMI(value)                   (NMIC_IER_NMI_Msk & ((value) << NMIC_IER_NMI_Pos))   

/* -------- NMIC_IDR : (NMIC Offset: 0x04) ( /W 32) Interrupt Disable Register -------- */
#define NMIC_IDR_NMI0_Pos                     _U_(0)                                               /**< (NMIC_IDR) Non-maskable Interrupt 0 Disable Position */
#define NMIC_IDR_NMI0_Msk                     (_U_(0x1) << NMIC_IDR_NMI0_Pos)                      /**< (NMIC_IDR) Non-maskable Interrupt 0 Disable Mask */
#define NMIC_IDR_NMI0(value)                  (NMIC_IDR_NMI0_Msk & ((value) << NMIC_IDR_NMI0_Pos))
#define NMIC_IDR_NMI1_Pos                     _U_(1)                                               /**< (NMIC_IDR) Non-maskable Interrupt 1 Disable Position */
#define NMIC_IDR_NMI1_Msk                     (_U_(0x1) << NMIC_IDR_NMI1_Pos)                      /**< (NMIC_IDR) Non-maskable Interrupt 1 Disable Mask */
#define NMIC_IDR_NMI1(value)                  (NMIC_IDR_NMI1_Msk & ((value) << NMIC_IDR_NMI1_Pos))
#define NMIC_IDR_NMI2_Pos                     _U_(2)                                               /**< (NMIC_IDR) Non-maskable Interrupt 2 Disable Position */
#define NMIC_IDR_NMI2_Msk                     (_U_(0x1) << NMIC_IDR_NMI2_Pos)                      /**< (NMIC_IDR) Non-maskable Interrupt 2 Disable Mask */
#define NMIC_IDR_NMI2(value)                  (NMIC_IDR_NMI2_Msk & ((value) << NMIC_IDR_NMI2_Pos))
#define NMIC_IDR_NMI3_Pos                     _U_(3)                                               /**< (NMIC_IDR) Non-maskable Interrupt 3 Disable Position */
#define NMIC_IDR_NMI3_Msk                     (_U_(0x1) << NMIC_IDR_NMI3_Pos)                      /**< (NMIC_IDR) Non-maskable Interrupt 3 Disable Mask */
#define NMIC_IDR_NMI3(value)                  (NMIC_IDR_NMI3_Msk & ((value) << NMIC_IDR_NMI3_Pos))
#define NMIC_IDR_NMI4_Pos                     _U_(4)                                               /**< (NMIC_IDR) Non-maskable Interrupt 4 Disable Position */
#define NMIC_IDR_NMI4_Msk                     (_U_(0x1) << NMIC_IDR_NMI4_Pos)                      /**< (NMIC_IDR) Non-maskable Interrupt 4 Disable Mask */
#define NMIC_IDR_NMI4(value)                  (NMIC_IDR_NMI4_Msk & ((value) << NMIC_IDR_NMI4_Pos))
#define NMIC_IDR_NMI5_Pos                     _U_(5)                                               /**< (NMIC_IDR) Non-maskable Interrupt 5 Disable Position */
#define NMIC_IDR_NMI5_Msk                     (_U_(0x1) << NMIC_IDR_NMI5_Pos)                      /**< (NMIC_IDR) Non-maskable Interrupt 5 Disable Mask */
#define NMIC_IDR_NMI5(value)                  (NMIC_IDR_NMI5_Msk & ((value) << NMIC_IDR_NMI5_Pos))
#define NMIC_IDR_NMI6_Pos                     _U_(6)                                               /**< (NMIC_IDR) Non-maskable Interrupt 6 Disable Position */
#define NMIC_IDR_NMI6_Msk                     (_U_(0x1) << NMIC_IDR_NMI6_Pos)                      /**< (NMIC_IDR) Non-maskable Interrupt 6 Disable Mask */
#define NMIC_IDR_NMI6(value)                  (NMIC_IDR_NMI6_Msk & ((value) << NMIC_IDR_NMI6_Pos))
#define NMIC_IDR_NMI7_Pos                     _U_(7)                                               /**< (NMIC_IDR) Non-maskable Interrupt 7 Disable Position */
#define NMIC_IDR_NMI7_Msk                     (_U_(0x1) << NMIC_IDR_NMI7_Pos)                      /**< (NMIC_IDR) Non-maskable Interrupt 7 Disable Mask */
#define NMIC_IDR_NMI7(value)                  (NMIC_IDR_NMI7_Msk & ((value) << NMIC_IDR_NMI7_Pos))
#define NMIC_IDR_NMI8_Pos                     _U_(8)                                               /**< (NMIC_IDR) Non-maskable Interrupt 8 Disable Position */
#define NMIC_IDR_NMI8_Msk                     (_U_(0x1) << NMIC_IDR_NMI8_Pos)                      /**< (NMIC_IDR) Non-maskable Interrupt 8 Disable Mask */
#define NMIC_IDR_NMI8(value)                  (NMIC_IDR_NMI8_Msk & ((value) << NMIC_IDR_NMI8_Pos))
#define NMIC_IDR_Msk                          _U_(0x000001FF)                                      /**< (NMIC_IDR) Register Mask  */

#define NMIC_IDR_NMI_Pos                      _U_(0)                                               /**< (NMIC_IDR Position) Non-maskable Interrupt 8 Disable */
#define NMIC_IDR_NMI_Msk                      (_U_(0x1FF) << NMIC_IDR_NMI_Pos)                     /**< (NMIC_IDR Mask) NMI */
#define NMIC_IDR_NMI(value)                   (NMIC_IDR_NMI_Msk & ((value) << NMIC_IDR_NMI_Pos))   

/* -------- NMIC_IAR : (NMIC Offset: 0x08) ( R/ 32) Interrupt Active Register -------- */
#define NMIC_IAR_NMI0_Pos                     _U_(0)                                               /**< (NMIC_IAR) Active Interrupt 0 Position */
#define NMIC_IAR_NMI0_Msk                     (_U_(0x1) << NMIC_IAR_NMI0_Pos)                      /**< (NMIC_IAR) Active Interrupt 0 Mask */
#define NMIC_IAR_NMI0(value)                  (NMIC_IAR_NMI0_Msk & ((value) << NMIC_IAR_NMI0_Pos))
#define NMIC_IAR_NMI1_Pos                     _U_(1)                                               /**< (NMIC_IAR) Active Interrupt 1 Position */
#define NMIC_IAR_NMI1_Msk                     (_U_(0x1) << NMIC_IAR_NMI1_Pos)                      /**< (NMIC_IAR) Active Interrupt 1 Mask */
#define NMIC_IAR_NMI1(value)                  (NMIC_IAR_NMI1_Msk & ((value) << NMIC_IAR_NMI1_Pos))
#define NMIC_IAR_NMI2_Pos                     _U_(2)                                               /**< (NMIC_IAR) Active Interrupt 2 Position */
#define NMIC_IAR_NMI2_Msk                     (_U_(0x1) << NMIC_IAR_NMI2_Pos)                      /**< (NMIC_IAR) Active Interrupt 2 Mask */
#define NMIC_IAR_NMI2(value)                  (NMIC_IAR_NMI2_Msk & ((value) << NMIC_IAR_NMI2_Pos))
#define NMIC_IAR_NMI3_Pos                     _U_(3)                                               /**< (NMIC_IAR) Active Interrupt 3 Position */
#define NMIC_IAR_NMI3_Msk                     (_U_(0x1) << NMIC_IAR_NMI3_Pos)                      /**< (NMIC_IAR) Active Interrupt 3 Mask */
#define NMIC_IAR_NMI3(value)                  (NMIC_IAR_NMI3_Msk & ((value) << NMIC_IAR_NMI3_Pos))
#define NMIC_IAR_NMI4_Pos                     _U_(4)                                               /**< (NMIC_IAR) Active Interrupt 4 Position */
#define NMIC_IAR_NMI4_Msk                     (_U_(0x1) << NMIC_IAR_NMI4_Pos)                      /**< (NMIC_IAR) Active Interrupt 4 Mask */
#define NMIC_IAR_NMI4(value)                  (NMIC_IAR_NMI4_Msk & ((value) << NMIC_IAR_NMI4_Pos))
#define NMIC_IAR_NMI5_Pos                     _U_(5)                                               /**< (NMIC_IAR) Active Interrupt 5 Position */
#define NMIC_IAR_NMI5_Msk                     (_U_(0x1) << NMIC_IAR_NMI5_Pos)                      /**< (NMIC_IAR) Active Interrupt 5 Mask */
#define NMIC_IAR_NMI5(value)                  (NMIC_IAR_NMI5_Msk & ((value) << NMIC_IAR_NMI5_Pos))
#define NMIC_IAR_NMI6_Pos                     _U_(6)                                               /**< (NMIC_IAR) Active Interrupt 6 Position */
#define NMIC_IAR_NMI6_Msk                     (_U_(0x1) << NMIC_IAR_NMI6_Pos)                      /**< (NMIC_IAR) Active Interrupt 6 Mask */
#define NMIC_IAR_NMI6(value)                  (NMIC_IAR_NMI6_Msk & ((value) << NMIC_IAR_NMI6_Pos))
#define NMIC_IAR_NMI7_Pos                     _U_(7)                                               /**< (NMIC_IAR) Active Interrupt 7 Position */
#define NMIC_IAR_NMI7_Msk                     (_U_(0x1) << NMIC_IAR_NMI7_Pos)                      /**< (NMIC_IAR) Active Interrupt 7 Mask */
#define NMIC_IAR_NMI7(value)                  (NMIC_IAR_NMI7_Msk & ((value) << NMIC_IAR_NMI7_Pos))
#define NMIC_IAR_NMI8_Pos                     _U_(8)                                               /**< (NMIC_IAR) Active Interrupt 8 Position */
#define NMIC_IAR_NMI8_Msk                     (_U_(0x1) << NMIC_IAR_NMI8_Pos)                      /**< (NMIC_IAR) Active Interrupt 8 Mask */
#define NMIC_IAR_NMI8(value)                  (NMIC_IAR_NMI8_Msk & ((value) << NMIC_IAR_NMI8_Pos))
#define NMIC_IAR_Msk                          _U_(0x000001FF)                                      /**< (NMIC_IAR) Register Mask  */

#define NMIC_IAR_NMI_Pos                      _U_(0)                                               /**< (NMIC_IAR Position) Active Interrupt 8 */
#define NMIC_IAR_NMI_Msk                      (_U_(0x1FF) << NMIC_IAR_NMI_Pos)                     /**< (NMIC_IAR Mask) NMI */
#define NMIC_IAR_NMI(value)                   (NMIC_IAR_NMI_Msk & ((value) << NMIC_IAR_NMI_Pos))   

