Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/nmic.h
/* -------- NMIC_SCFGxR2 : (NMIC Offset: 0x1C) (R/W 32) Source Configuration Register 0 2 -------- */
#define NMIC_SCFGxR2_GFSEL_Pos                _U_(0)                                               /**< (NMIC_SCFGxR2) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR2_GFSEL_Msk                (_U_(0x3) << NMIC_SCFGxR2_GFSEL_Pos)                 /**< (NMIC_SCFGxR2) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR2_GFSEL(value)             (NMIC_SCFGxR2_GFSEL_Msk & ((value) << NMIC_SCFGxR2_GFSEL_Pos))
#define NMIC_SCFGxR2_GFEN_Pos                 _U_(4)                                               /**< (NMIC_SCFGxR2) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR2_GFEN_Msk                 (_U_(0x1) << NMIC_SCFGxR2_GFEN_Pos)                  /**< (NMIC_SCFGxR2) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR2_GFEN(value)              (NMIC_SCFGxR2_GFEN_Msk & ((value) << NMIC_SCFGxR2_GFEN_Pos))
#define NMIC_SCFGxR2_POL_Pos                  _U_(8)                                               /**< (NMIC_SCFGxR2) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR2_POL_Msk                  (_U_(0x1) << NMIC_SCFGxR2_POL_Pos)                   /**< (NMIC_SCFGxR2) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR2_POL(value)               (NMIC_SCFGxR2_POL_Msk & ((value) << NMIC_SCFGxR2_POL_Pos))
#define NMIC_SCFGxR2_LVL_Pos                  _U_(9)                                               /**< (NMIC_SCFGxR2) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR2_LVL_Msk                  (_U_(0x1) << NMIC_SCFGxR2_LVL_Pos)                   /**< (NMIC_SCFGxR2) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR2_LVL(value)               (NMIC_SCFGxR2_LVL_Msk & ((value) << NMIC_SCFGxR2_LVL_Pos))
#define NMIC_SCFGxR2_EN_Pos                   _U_(16)                                              /**< (NMIC_SCFGxR2) Source Enable Position */
#define NMIC_SCFGxR2_EN_Msk                   (_U_(0x1) << NMIC_SCFGxR2_EN_Pos)                    /**< (NMIC_SCFGxR2) Source Enable Mask */
#define NMIC_SCFGxR2_EN(value)                (NMIC_SCFGxR2_EN_Msk & ((value) << NMIC_SCFGxR2_EN_Pos))
#define NMIC_SCFGxR2_FRZ_Pos                  _U_(31)                                              /**< (NMIC_SCFGxR2) Interrupt Line Freeze Position */
#define NMIC_SCFGxR2_FRZ_Msk                  (_U_(0x1) << NMIC_SCFGxR2_FRZ_Pos)                   /**< (NMIC_SCFGxR2) Interrupt Line Freeze Mask */
#define NMIC_SCFGxR2_FRZ(value)               (NMIC_SCFGxR2_FRZ_Msk & ((value) << NMIC_SCFGxR2_FRZ_Pos))
#define NMIC_SCFGxR2_Msk                      _U_(0x80010313)                                      /**< (NMIC_SCFGxR2) Register Mask  */


/* -------- NMIC_SCFGxR3 : (NMIC Offset: 0x20) (R/W 32) Source Configuration Register 0 3 -------- */
#define NMIC_SCFGxR3_GFSEL_Pos                _U_(0)                                               /**< (NMIC_SCFGxR3) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR3_GFSEL_Msk                (_U_(0x3) << NMIC_SCFGxR3_GFSEL_Pos)                 /**< (NMIC_SCFGxR3) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR3_GFSEL(value)             (NMIC_SCFGxR3_GFSEL_Msk & ((value) << NMIC_SCFGxR3_GFSEL_Pos))
#define NMIC_SCFGxR3_GFEN_Pos                 _U_(4)                                               /**< (NMIC_SCFGxR3) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR3_GFEN_Msk                 (_U_(0x1) << NMIC_SCFGxR3_GFEN_Pos)                  /**< (NMIC_SCFGxR3) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR3_GFEN(value)              (NMIC_SCFGxR3_GFEN_Msk & ((value) << NMIC_SCFGxR3_GFEN_Pos))
#define NMIC_SCFGxR3_POL_Pos                  _U_(8)                                               /**< (NMIC_SCFGxR3) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR3_POL_Msk                  (_U_(0x1) << NMIC_SCFGxR3_POL_Pos)                   /**< (NMIC_SCFGxR3) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR3_POL(value)               (NMIC_SCFGxR3_POL_Msk & ((value) << NMIC_SCFGxR3_POL_Pos))
#define NMIC_SCFGxR3_LVL_Pos                  _U_(9)                                               /**< (NMIC_SCFGxR3) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR3_LVL_Msk                  (_U_(0x1) << NMIC_SCFGxR3_LVL_Pos)                   /**< (NMIC_SCFGxR3) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR3_LVL(value)               (NMIC_SCFGxR3_LVL_Msk & ((value) << NMIC_SCFGxR3_LVL_Pos))
#define NMIC_SCFGxR3_EN_Pos                   _U_(16)                                              /**< (NMIC_SCFGxR3) Source Enable Position */
#define NMIC_SCFGxR3_EN_Msk                   (_U_(0x1) << NMIC_SCFGxR3_EN_Pos)                    /**< (NMIC_SCFGxR3) Source Enable Mask */
#define NMIC_SCFGxR3_EN(value)                (NMIC_SCFGxR3_EN_Msk & ((value) << NMIC_SCFGxR3_EN_Pos))
#define NMIC_SCFGxR3_FRZ_Pos                  _U_(31)                                              /**< (NMIC_SCFGxR3) Interrupt Line Freeze Position */
#define NMIC_SCFGxR3_FRZ_Msk                  (_U_(0x1) << NMIC_SCFGxR3_FRZ_Pos)                   /**< (NMIC_SCFGxR3) Interrupt Line Freeze Mask */
#define NMIC_SCFGxR3_FRZ(value)               (NMIC_SCFGxR3_FRZ_Msk & ((value) << NMIC_SCFGxR3_FRZ_Pos))
#define NMIC_SCFGxR3_Msk                      _U_(0x80010313)                                      /**< (NMIC_SCFGxR3) Register Mask  */


/* -------- NMIC_SCFGxR4 : (NMIC Offset: 0x24) (R/W 32) Source Configuration Register 0 4 -------- */
#define NMIC_SCFGxR4_GFSEL_Pos                _U_(0)                                               /**< (NMIC_SCFGxR4) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR4_GFSEL_Msk                (_U_(0x3) << NMIC_SCFGxR4_GFSEL_Pos)                 /**< (NMIC_SCFGxR4) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR4_GFSEL(value)             (NMIC_SCFGxR4_GFSEL_Msk & ((value) << NMIC_SCFGxR4_GFSEL_Pos))
#define NMIC_SCFGxR4_GFEN_Pos                 _U_(4)                                               /**< (NMIC_SCFGxR4) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR4_GFEN_Msk                 (_U_(0x1) << NMIC_SCFGxR4_GFEN_Pos)                  /**< (NMIC_SCFGxR4) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR4_GFEN(value)              (NMIC_SCFGxR4_GFEN_Msk & ((value) << NMIC_SCFGxR4_GFEN_Pos))
#define NMIC_SCFGxR4_POL_Pos                  _U_(8)                                               /**< (NMIC_SCFGxR4) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR4_POL_Msk                  (_U_(0x1) << NMIC_SCFGxR4_POL_Pos)                   /**< (NMIC_SCFGxR4) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR4_POL(value)               (NMIC_SCFGxR4_POL_Msk & ((value) << NMIC_SCFGxR4_POL_Pos))
#define NMIC_SCFGxR4_LVL_Pos                  _U_(9)                                               /**< (NMIC_SCFGxR4) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR4_LVL_Msk                  (_U_(0x1) << NMIC_SCFGxR4_LVL_Pos)                   /**< (NMIC_SCFGxR4) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR4_LVL(value)               (NMIC_SCFGxR4_LVL_Msk & ((value) << NMIC_SCFGxR4_LVL_Pos))
#define NMIC_SCFGxR4_EN_Pos                   _U_(16)                                              /**< (NMIC_SCFGxR4) Source Enable Position */
#define NMIC_SCFGxR4_EN_Msk                   (_U_(0x1) << NMIC_SCFGxR4_EN_Pos)                    /**< (NMIC_SCFGxR4) Source Enable Mask */
#define NMIC_SCFGxR4_EN(value)                (NMIC_SCFGxR4_EN_Msk & ((value) << NMIC_SCFGxR4_EN_Pos))
#define NMIC_SCFGxR4_FRZ_Pos                  _U_(31)                                              /**< (NMIC_SCFGxR4) Interrupt Line Freeze Position */
#define NMIC_SCFGxR4_FRZ_Msk                  (_U_(0x1) << NMIC_SCFGxR4_FRZ_Pos)                   /**< (NMIC_SCFGxR4) Interrupt Line Freeze Mask */
#define NMIC_SCFGxR4_FRZ(value)               (NMIC_SCFGxR4_FRZ_Msk & ((value) << NMIC_SCFGxR4_FRZ_Pos))
#define NMIC_SCFGxR4_Msk                      _U_(0x80010313)                                      /**< (NMIC_SCFGxR4) Register Mask  */


/* -------- NMIC_SCFGxR5 : (NMIC Offset: 0x28) (R/W 32) Source Configuration Register 0 5 -------- */
#define NMIC_SCFGxR5_GFSEL_Pos                _U_(0)                                               /**< (NMIC_SCFGxR5) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR5_GFSEL_Msk                (_U_(0x3) << NMIC_SCFGxR5_GFSEL_Pos)                 /**< (NMIC_SCFGxR5) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR5_GFSEL(value)             (NMIC_SCFGxR5_GFSEL_Msk & ((value) << NMIC_SCFGxR5_GFSEL_Pos))
#define NMIC_SCFGxR5_GFEN_Pos                 _U_(4)                                               /**< (NMIC_SCFGxR5) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR5_GFEN_Msk                 (_U_(0x1) << NMIC_SCFGxR5_GFEN_Pos)                  /**< (NMIC_SCFGxR5) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR5_GFEN(value)              (NMIC_SCFGxR5_GFEN_Msk & ((value) << NMIC_SCFGxR5_GFEN_Pos))
#define NMIC_SCFGxR5_POL_Pos                  _U_(8)                                               /**< (NMIC_SCFGxR5) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR5_POL_Msk                  (_U_(0x1) << NMIC_SCFGxR5_POL_Pos)                   /**< (NMIC_SCFGxR5) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR5_POL(value)               (NMIC_SCFGxR5_POL_Msk & ((value) << NMIC_SCFGxR5_POL_Pos))
#define NMIC_SCFGxR5_LVL_Pos                  _U_(9)                                               /**< (NMIC_SCFGxR5) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR5_LVL_Msk                  (_U_(0x1) << NMIC_SCFGxR5_LVL_Pos)                   /**< (NMIC_SCFGxR5) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR5_LVL(value)               (NMIC_SCFGxR5_LVL_Msk & ((value) << NMIC_SCFGxR5_LVL_Pos))
#define NMIC_SCFGxR5_EN_Pos                   _U_(16)                                              /**< (NMIC_SCFGxR5) Source Enable Position */
#define NMIC_SCFGxR5_EN_Msk                   (_U_(0x1) << NMIC_SCFGxR5_EN_Pos)                    /**< (NMIC_SCFGxR5) Source Enable Mask */
#define NMIC_SCFGxR5_EN(value)                (NMIC_SCFGxR5_EN_Msk & ((value) << NMIC_SCFGxR5_EN_Pos))
#define NMIC_SCFGxR5_FRZ_Pos                  _U_(31)                                              /**< (NMIC_SCFGxR5) Interrupt Line Freeze Position */
#define NMIC_SCFGxR5_FRZ_Msk                  (_U_(0x1) << NMIC_SCFGxR5_FRZ_Pos)                   /**< (NMIC_SCFGxR5) Interrupt Line Freeze Mask */
#define NMIC_SCFGxR5_FRZ(value)               (NMIC_SCFGxR5_FRZ_Msk & ((value) << NMIC_SCFGxR5_FRZ_Pos))
#define NMIC_SCFGxR5_Msk                      _U_(0x80010313)                                      /**< (NMIC_SCFGxR5) Register Mask  */


/* -------- NMIC_SCFGxR6 : (NMIC Offset: 0x2C) (R/W 32) Source Configuration Register 0 6 -------- */
#define NMIC_SCFGxR6_GFSEL_Pos                _U_(0)                                               /**< (NMIC_SCFGxR6) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR6_GFSEL_Msk                (_U_(0x3) << NMIC_SCFGxR6_GFSEL_Pos)                 /**< (NMIC_SCFGxR6) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR6_GFSEL(value)             (NMIC_SCFGxR6_GFSEL_Msk & ((value) << NMIC_SCFGxR6_GFSEL_Pos))
#define NMIC_SCFGxR6_GFEN_Pos                 _U_(4)                                               /**< (NMIC_SCFGxR6) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR6_GFEN_Msk                 (_U_(0x1) << NMIC_SCFGxR6_GFEN_Pos)                  /**< (NMIC_SCFGxR6) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR6_GFEN(value)              (NMIC_SCFGxR6_GFEN_Msk & ((value) << NMIC_SCFGxR6_GFEN_Pos))
#define NMIC_SCFGxR6_POL_Pos                  _U_(8)                                               /**< (NMIC_SCFGxR6) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR6_POL_Msk                  (_U_(0x1) << NMIC_SCFGxR6_POL_Pos)                   /**< (NMIC_SCFGxR6) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR6_POL(value)               (NMIC_SCFGxR6_POL_Msk & ((value) << NMIC_SCFGxR6_POL_Pos))
#define NMIC_SCFGxR6_LVL_Pos                  _U_(9)                                               /**< (NMIC_SCFGxR6) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR6_LVL_Msk                  (_U_(0x1) << NMIC_SCFGxR6_LVL_Pos)                   /**< (NMIC_SCFGxR6) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR6_LVL(value)               (NMIC_SCFGxR6_LVL_Msk & ((value) << NMIC_SCFGxR6_LVL_Pos))
#define NMIC_SCFGxR6_EN_Pos                   _U_(16)                                              /**< (NMIC_SCFGxR6) Source Enable Position */
#define NMIC_SCFGxR6_EN_Msk                   (_U_(0x1) << NMIC_SCFGxR6_EN_Pos)                    /**< (NMIC_SCFGxR6) Source Enable Mask */
#define NMIC_SCFGxR6_EN(value)                (NMIC_SCFGxR6_EN_Msk & ((value) << NMIC_SCFGxR6_EN_Pos))
#define NMIC_SCFGxR6_FRZ_Pos                  _U_(31)                                              /**< (NMIC_SCFGxR6) Interrupt Line Freeze Position */
#define NMIC_SCFGxR6_FRZ_Msk                  (_U_(0x1) << NMIC_SCFGxR6_FRZ_Pos)                   /**< (NMIC_SCFGxR6) Interrupt Line Freeze Mask */
#define NMIC_SCFGxR6_FRZ(value)               (NMIC_SCFGxR6_FRZ_Msk & ((value) << NMIC_SCFGxR6_FRZ_Pos))
#define NMIC_SCFGxR6_Msk                      _U_(0x80010313)                                      /**< (NMIC_SCFGxR6) Register Mask  */


