Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/nmic.h
/* -------- NMIC_SCFGxR7 : (NMIC Offset: 0x30) (R/W 32) Source Configuration Register 0 7 -------- */
#define NMIC_SCFGxR7_GFSEL_Pos                _U_(0)                                               /**< (NMIC_SCFGxR7) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR7_GFSEL_Msk                (_U_(0x3) << NMIC_SCFGxR7_GFSEL_Pos)                 /**< (NMIC_SCFGxR7) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR7_GFSEL(value)             (NMIC_SCFGxR7_GFSEL_Msk & ((value) << NMIC_SCFGxR7_GFSEL_Pos))
#define NMIC_SCFGxR7_GFEN_Pos                 _U_(4)                                               /**< (NMIC_SCFGxR7) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR7_GFEN_Msk                 (_U_(0x1) << NMIC_SCFGxR7_GFEN_Pos)                  /**< (NMIC_SCFGxR7) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR7_GFEN(value)              (NMIC_SCFGxR7_GFEN_Msk & ((value) << NMIC_SCFGxR7_GFEN_Pos))
#define NMIC_SCFGxR7_POL_Pos                  _U_(8)                                               /**< (NMIC_SCFGxR7) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR7_POL_Msk                  (_U_(0x1) << NMIC_SCFGxR7_POL_Pos)                   /**< (NMIC_SCFGxR7) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR7_POL(value)               (NMIC_SCFGxR7_POL_Msk & ((value) << NMIC_SCFGxR7_POL_Pos))
#define NMIC_SCFGxR7_LVL_Pos                  _U_(9)                                               /**< (NMIC_SCFGxR7) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR7_LVL_Msk                  (_U_(0x1) << NMIC_SCFGxR7_LVL_Pos)                   /**< (NMIC_SCFGxR7) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR7_LVL(value)               (NMIC_SCFGxR7_LVL_Msk & ((value) << NMIC_SCFGxR7_LVL_Pos))
#define NMIC_SCFGxR7_EN_Pos                   _U_(16)                                              /**< (NMIC_SCFGxR7) Source Enable Position */
#define NMIC_SCFGxR7_EN_Msk                   (_U_(0x1) << NMIC_SCFGxR7_EN_Pos)                    /**< (NMIC_SCFGxR7) Source Enable Mask */
#define NMIC_SCFGxR7_EN(value)                (NMIC_SCFGxR7_EN_Msk & ((value) << NMIC_SCFGxR7_EN_Pos))
#define NMIC_SCFGxR7_FRZ_Pos                  _U_(31)                                              /**< (NMIC_SCFGxR7) Interrupt Line Freeze Position */
#define NMIC_SCFGxR7_FRZ_Msk                  (_U_(0x1) << NMIC_SCFGxR7_FRZ_Pos)                   /**< (NMIC_SCFGxR7) Interrupt Line Freeze Mask */
#define NMIC_SCFGxR7_FRZ(value)               (NMIC_SCFGxR7_FRZ_Msk & ((value) << NMIC_SCFGxR7_FRZ_Pos))
#define NMIC_SCFGxR7_Msk                      _U_(0x80010313)                                      /**< (NMIC_SCFGxR7) Register Mask  */


/* -------- NMIC_SCFGxR8 : (NMIC Offset: 0x34) (R/W 32) Source Configuration Register 0 8 -------- */
#define NMIC_SCFGxR8_GFSEL_Pos                _U_(0)                                               /**< (NMIC_SCFGxR8) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR8_GFSEL_Msk                (_U_(0x3) << NMIC_SCFGxR8_GFSEL_Pos)                 /**< (NMIC_SCFGxR8) Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR8_GFSEL(value)             (NMIC_SCFGxR8_GFSEL_Msk & ((value) << NMIC_SCFGxR8_GFSEL_Pos))
#define NMIC_SCFGxR8_GFEN_Pos                 _U_(4)                                               /**< (NMIC_SCFGxR8) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR8_GFEN_Msk                 (_U_(0x1) << NMIC_SCFGxR8_GFEN_Pos)                  /**< (NMIC_SCFGxR8) Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR8_GFEN(value)              (NMIC_SCFGxR8_GFEN_Msk & ((value) << NMIC_SCFGxR8_GFEN_Pos))
#define NMIC_SCFGxR8_POL_Pos                  _U_(8)                                               /**< (NMIC_SCFGxR8) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR8_POL_Msk                  (_U_(0x1) << NMIC_SCFGxR8_POL_Pos)                   /**< (NMIC_SCFGxR8) Polarity (POL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR8_POL(value)               (NMIC_SCFGxR8_POL_Msk & ((value) << NMIC_SCFGxR8_POL_Pos))
#define NMIC_SCFGxR8_LVL_Pos                  _U_(9)                                               /**< (NMIC_SCFGxR8) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Position */
#define NMIC_SCFGxR8_LVL_Msk                  (_U_(0x1) << NMIC_SCFGxR8_LVL_Pos)                   /**< (NMIC_SCFGxR8) Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8) Mask */
#define NMIC_SCFGxR8_LVL(value)               (NMIC_SCFGxR8_LVL_Msk & ((value) << NMIC_SCFGxR8_LVL_Pos))
#define NMIC_SCFGxR8_EN_Pos                   _U_(16)                                              /**< (NMIC_SCFGxR8) Source Enable Position */
#define NMIC_SCFGxR8_EN_Msk                   (_U_(0x1) << NMIC_SCFGxR8_EN_Pos)                    /**< (NMIC_SCFGxR8) Source Enable Mask */
#define NMIC_SCFGxR8_EN(value)                (NMIC_SCFGxR8_EN_Msk & ((value) << NMIC_SCFGxR8_EN_Pos))
#define NMIC_SCFGxR8_FRZ_Pos                  _U_(31)                                              /**< (NMIC_SCFGxR8) Interrupt Line Freeze Position */
#define NMIC_SCFGxR8_FRZ_Msk                  (_U_(0x1) << NMIC_SCFGxR8_FRZ_Pos)                   /**< (NMIC_SCFGxR8) Interrupt Line Freeze Mask */
#define NMIC_SCFGxR8_FRZ(value)               (NMIC_SCFGxR8_FRZ_Msk & ((value) << NMIC_SCFGxR8_FRZ_Pos))
#define NMIC_SCFGxR8_Msk                      _U_(0x80010313)                                      /**< (NMIC_SCFGxR8) Register Mask  */


/* -------- NMIC_WPMR : (NMIC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define NMIC_WPMR_WPCFEN_Pos                  _U_(0)                                               /**< (NMIC_WPMR) Write Protection Configuration Enable Position */
#define NMIC_WPMR_WPCFEN_Msk                  (_U_(0x1) << NMIC_WPMR_WPCFEN_Pos)                   /**< (NMIC_WPMR) Write Protection Configuration Enable Mask */
#define NMIC_WPMR_WPCFEN(value)               (NMIC_WPMR_WPCFEN_Msk & ((value) << NMIC_WPMR_WPCFEN_Pos))
#define NMIC_WPMR_WPITEN_Pos                  _U_(1)                                               /**< (NMIC_WPMR) Write Protection Interrupt Enable Position */
#define NMIC_WPMR_WPITEN_Msk                  (_U_(0x1) << NMIC_WPMR_WPITEN_Pos)                   /**< (NMIC_WPMR) Write Protection Interrupt Enable Mask */
#define NMIC_WPMR_WPITEN(value)               (NMIC_WPMR_WPITEN_Msk & ((value) << NMIC_WPMR_WPITEN_Pos))
#define NMIC_WPMR_WPKEY_Pos                   _U_(8)                                               /**< (NMIC_WPMR) Write Protection Key Position */
#define NMIC_WPMR_WPKEY_Msk                   (_U_(0xFFFFFF) << NMIC_WPMR_WPKEY_Pos)               /**< (NMIC_WPMR) Write Protection Key Mask */
#define NMIC_WPMR_WPKEY(value)                (NMIC_WPMR_WPKEY_Msk & ((value) << NMIC_WPMR_WPKEY_Pos))
#define   NMIC_WPMR_WPKEY_PASSWD_Val          _U_(0x4E4D49)                                        /**< (NMIC_WPMR) Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0.  */
#define NMIC_WPMR_WPKEY_PASSWD                (NMIC_WPMR_WPKEY_PASSWD_Val << NMIC_WPMR_WPKEY_Pos)  /**< (NMIC_WPMR) Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0. Position  */
#define NMIC_WPMR_Msk                         _U_(0xFFFFFF03)                                      /**< (NMIC_WPMR) Register Mask  */


/* -------- NMIC_WPSR : (NMIC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define NMIC_WPSR_WPVS_Pos                    _U_(0)                                               /**< (NMIC_WPSR) Write Protection Register Violation Status Position */
#define NMIC_WPSR_WPVS_Msk                    (_U_(0x1) << NMIC_WPSR_WPVS_Pos)                     /**< (NMIC_WPSR) Write Protection Register Violation Status Mask */
#define NMIC_WPSR_WPVS(value)                 (NMIC_WPSR_WPVS_Msk & ((value) << NMIC_WPSR_WPVS_Pos))
#define NMIC_WPSR_FZWVS_Pos                   _U_(1)                                               /**< (NMIC_WPSR) Frozen Register Write Violation Status Position */
#define NMIC_WPSR_FZWVS_Msk                   (_U_(0x1) << NMIC_WPSR_FZWVS_Pos)                    /**< (NMIC_WPSR) Frozen Register Write Violation Status Mask */
#define NMIC_WPSR_FZWVS(value)                (NMIC_WPSR_FZWVS_Msk & ((value) << NMIC_WPSR_FZWVS_Pos))
#define NMIC_WPSR_BSWVS_Pos                   _U_(2)                                               /**< (NMIC_WPSR) Busy Register Write Violation Status Position */
#define NMIC_WPSR_BSWVS_Msk                   (_U_(0x1) << NMIC_WPSR_BSWVS_Pos)                    /**< (NMIC_WPSR) Busy Register Write Violation Status Mask */
#define NMIC_WPSR_BSWVS(value)                (NMIC_WPSR_BSWVS_Msk & ((value) << NMIC_WPSR_BSWVS_Pos))
#define NMIC_WPSR_WVSRC_Pos                   _U_(8)                                               /**< (NMIC_WPSR) Write Violation Source Position */
#define NMIC_WPSR_WVSRC_Msk                   (_U_(0xFF) << NMIC_WPSR_WVSRC_Pos)                   /**< (NMIC_WPSR) Write Violation Source Mask */
#define NMIC_WPSR_WVSRC(value)                (NMIC_WPSR_WVSRC_Msk & ((value) << NMIC_WPSR_WVSRC_Pos))
#define NMIC_WPSR_Msk                         _U_(0x0000FF07)                                      /**< (NMIC_WPSR) Register Mask  */


