Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/nmic.h
/** \brief NMIC register offsets definitions */
#define NMIC_IER_REG_OFST              (0x00)              /**< (NMIC_IER) Interrupt Enable Register Offset */
#define NMIC_IDR_REG_OFST              (0x04)              /**< (NMIC_IDR) Interrupt Disable Register Offset */
#define NMIC_IAR_REG_OFST              (0x08)              /**< (NMIC_IAR) Interrupt Active Register Offset */
#define NMIC_ISR_REG_OFST              (0x0C)              /**< (NMIC_ISR) Interrupt Status Register Offset */
#define NMIC_GFCS_REG_OFST             (0x10)              /**< (NMIC_GFCS) Glitch Filter Configuration Status Register Offset */
#define NMIC_SCFGxR0_REG_OFST          (0x14)              /**< (NMIC_SCFGxR0) Source Configuration Register 0 0 Offset */
#define NMIC_SCFGxR1_REG_OFST          (0x18)              /**< (NMIC_SCFGxR1) Source Configuration Register 0 1 Offset */
#define NMIC_SCFGxR2_REG_OFST          (0x1C)              /**< (NMIC_SCFGxR2) Source Configuration Register 0 2 Offset */
#define NMIC_SCFGxR3_REG_OFST          (0x20)              /**< (NMIC_SCFGxR3) Source Configuration Register 0 3 Offset */
#define NMIC_SCFGxR4_REG_OFST          (0x24)              /**< (NMIC_SCFGxR4) Source Configuration Register 0 4 Offset */
#define NMIC_SCFGxR5_REG_OFST          (0x28)              /**< (NMIC_SCFGxR5) Source Configuration Register 0 5 Offset */
#define NMIC_SCFGxR6_REG_OFST          (0x2C)              /**< (NMIC_SCFGxR6) Source Configuration Register 0 6 Offset */
#define NMIC_SCFGxR7_REG_OFST          (0x30)              /**< (NMIC_SCFGxR7) Source Configuration Register 0 7 Offset */
#define NMIC_SCFGxR8_REG_OFST          (0x34)              /**< (NMIC_SCFGxR8) Source Configuration Register 0 8 Offset */
#define NMIC_WPMR_REG_OFST             (0xE4)              /**< (NMIC_WPMR) Write Protection Mode Register Offset */
#define NMIC_WPSR_REG_OFST             (0xE8)              /**< (NMIC_WPSR) Write Protection Status Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief NMIC register API structure */
typedef struct
{
  __O   uint32_t                       NMIC_IER;           /**< Offset: 0x00 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       NMIC_IDR;           /**< Offset: 0x04 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       NMIC_IAR;           /**< Offset: 0x08 (R/   32) Interrupt Active Register */
  __I   uint32_t                       NMIC_ISR;           /**< Offset: 0x0C (R/   32) Interrupt Status Register */
  __I   uint32_t                       NMIC_GFCS;          /**< Offset: 0x10 (R/   32) Glitch Filter Configuration Status Register */
  __IO  uint32_t                       NMIC_SCFGxR0;       /**< Offset: 0x14 (R/W  32) Source Configuration Register 0 0 */
  __IO  uint32_t                       NMIC_SCFGxR1;       /**< Offset: 0x18 (R/W  32) Source Configuration Register 0 1 */
  __IO  uint32_t                       NMIC_SCFGxR2;       /**< Offset: 0x1C (R/W  32) Source Configuration Register 0 2 */
  __IO  uint32_t                       NMIC_SCFGxR3;       /**< Offset: 0x20 (R/W  32) Source Configuration Register 0 3 */
  __IO  uint32_t                       NMIC_SCFGxR4;       /**< Offset: 0x24 (R/W  32) Source Configuration Register 0 4 */
  __IO  uint32_t                       NMIC_SCFGxR5;       /**< Offset: 0x28 (R/W  32) Source Configuration Register 0 5 */
  __IO  uint32_t                       NMIC_SCFGxR6;       /**< Offset: 0x2C (R/W  32) Source Configuration Register 0 6 */
  __IO  uint32_t                       NMIC_SCFGxR7;       /**< Offset: 0x30 (R/W  32) Source Configuration Register 0 7 */
  __IO  uint32_t                       NMIC_SCFGxR8;       /**< Offset: 0x34 (R/W  32) Source Configuration Register 0 8 */
  __I   uint8_t                        Reserved1[0xAC];
  __IO  uint32_t                       NMIC_WPMR;          /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       NMIC_WPSR;          /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} nmic_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH71_NMIC_COMPONENT_H_ */
